; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-3-2-6-7)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos1-0 pos1-1 pos1-2 pos2-0 pos2-1 pos2-2
    shape0 shape1
    key0 key1 key2 key3 key4 key5
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (shape shape0)
       (shape shape1)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-1)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (locked pos1-0)
       (locked pos0-1)
       (locked pos2-0)
       (locked pos0-2)
       (locked pos0-0)
       (locked pos2-2)
       (locked pos1-2)
       (lock-shape  pos1-0 shape0)
       (lock-shape  pos0-1 shape1)
       (lock-shape  pos2-0 shape0)
       (lock-shape  pos0-2 shape1)
       (lock-shape  pos0-0 shape0)
       (lock-shape  pos2-2 shape1)
       (lock-shape  pos1-2 shape1)
       (open pos1-1)
       (open pos2-1)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape1)
       (key-shape  key3 shape1)
       (key-shape  key4 shape0)
       (key-shape  key5 shape1)
       (at key0 pos1-1)
       (at key1 pos1-1)
       (at key2 pos0-1)
       (at key3 pos0-1)
       (at key4 pos0-2)
       (at key5 pos0-0)
       (at-robot pos2-1)
    )

    (:goal (and
       (at key0 pos0-1)
       (at key1 pos1-2)
       (at key2 pos1-0)
       (at key3 pos2-1)
       (at key4 pos2-2)
       (at key5 pos2-1)
    )))

; plan
1. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 0 of 6
2. (pickup pos1-1 key1)
   deleted: (at key1 pos1-1) (arm-empty)
   added: (holding key1)
   goals met: 0 of 6
3. (unlock pos1-1 pos0-1 key1 shape1)
   deleted: (locked pos0-1)
   added: (open pos0-1)
   goals met: 0 of 6
4. (pickup-and-loose pos1-1 key0 key1)
   deleted: (holding key1) (at key0 pos1-1)
   added: (holding key0) (at key1 pos1-1)
   goals met: 0 of 6
5. (unlock pos1-1 pos1-0 key0 shape0)
   deleted: (locked pos1-0)
   added: (open pos1-0)
   goals met: 0 of 6
6. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 0 of 6
7. (unlock pos0-1 pos0-0 key0 shape0)
   deleted: (locked pos0-0)
   added: (open pos0-0)
   goals met: 0 of 6
8. (pickup-and-loose pos0-1 key3 key0)
   deleted: (holding key0) (at key3 pos0-1)
   added: (holding key3) (at key0 pos0-1)
   goals met: 1 of 6
9. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 1 of 6
10. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 1 of 6
11. (putdown pos2-1 key3)
   deleted: (holding key3)
   added: (arm-empty) (at key3 pos2-1)
   goals met: 2 of 6
12. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 2 of 6
13. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 2 of 6
14. (pickup pos0-1 key2)
   deleted: (at key2 pos0-1) (arm-empty)
   added: (holding key2)
   goals met: 2 of 6
15. (move pos0-1 pos0-0)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-0)
   goals met: 2 of 6
16. (move pos0-0 pos1-0)
   deleted: (at-robot pos0-0)
   added: (at-robot pos1-0)
   goals met: 2 of 6
17. (putdown pos1-0 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos1-0)
   goals met: 3 of 6
18. (move pos1-0 pos0-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos0-0)
   goals met: 3 of 6
19. (pickup pos0-0 key5)
   deleted: (at key5 pos0-0) (arm-empty)
   added: (holding key5)
   goals met: 3 of 6
20. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 3 of 6
21. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 3 of 6
22. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 3 of 6
23. (putdown pos2-1 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos2-1)
   goals met: 4 of 6
24. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 4 of 6
25. (pickup pos1-1 key1)
   deleted: (at key1 pos1-1) (arm-empty)
   added: (holding key1)
   goals met: 4 of 6
26. (unlock pos1-1 pos1-2 key1 shape1)
   deleted: (locked pos1-2)
   added: (open pos1-2)
   goals met: 4 of 6
27. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 4 of 6
28. (unlock pos1-2 pos0-2 key1 shape1)
   deleted: (locked pos0-2)
   added: (open pos0-2)
   goals met: 4 of 6
29. (unlock pos1-2 pos2-2 key1 shape1)
   deleted: (locked pos2-2)
   added: (open pos2-2)
   goals met: 4 of 6
30. (putdown pos1-2 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos1-2)
   goals met: 5 of 6
31. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 5 of 6
32. (pickup pos0-2 key4)
   deleted: (at key4 pos0-2) (arm-empty)
   added: (holding key4)
   goals met: 5 of 6
33. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 5 of 6
34. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 5 of 6
35. (putdown pos2-2 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos2-2)
   goals met: 6 of 6
